layer {
  name: "data"
  type: "Input"
  top: "data"
  transform_param {
    scale: 0.00390625
    mirror: false
    yolo_height: 416
    yolo_width: 416
  }
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 416
      dim: 416
    }
  }
}
layer {
  name: "data_fixed"
  type: "FixedNeuron"
  bottom: "data"
  top: "data"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: OVER_FLOW
    bit_width: 8
    follow_data_layer: true
  }
}
layer {
  name: "layer0-conv"
  type: "Convolution"
  bottom: "data"
  top: "layer0-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer0-act"
  type: "ReLU"
  bottom: "layer0-conv"
  top: "layer0-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer0-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer0-conv"
  top: "layer0-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer1-conv"
  type: "Convolution"
  bottom: "layer0-conv"
  top: "layer1-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "layer1-act"
  type: "ReLU"
  bottom: "layer1-conv"
  top: "layer1-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer1-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer1-conv"
  top: "layer1-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer2-conv"
  type: "Convolution"
  bottom: "layer1-conv"
  top: "layer2-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer2-act"
  type: "ReLU"
  bottom: "layer2-conv"
  top: "layer2-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer4-conv"
  type: "Convolution"
  bottom: "layer1-conv"
  top: "layer4-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer4-act"
  type: "ReLU"
  bottom: "layer4-conv"
  top: "layer4-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer4-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer4-conv"
  top: "layer4-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer5-conv"
  type: "Convolution"
  bottom: "layer4-conv"
  top: "layer5-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer5-act"
  type: "ReLU"
  bottom: "layer5-conv"
  top: "layer5-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer5-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer5-conv"
  top: "layer5-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer6-conv"
  type: "Convolution"
  bottom: "layer5-conv"
  top: "layer6-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer6-act"
  type: "ReLU"
  bottom: "layer6-conv"
  top: "layer6-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer6-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer6-conv"
  top: "layer6-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer7-shortcut"
  type: "Eltwise"
  bottom: "layer4-conv"
  bottom: "layer6-conv"
  top: "layer7-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer7-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer7-shortcut"
  top: "layer7-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer8-conv"
  type: "Convolution"
  bottom: "layer7-shortcut"
  top: "layer8-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer8-act"
  type: "ReLU"
  bottom: "layer8-conv"
  top: "layer8-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer9-concat"
  type: "Concat"
  bottom: "layer8-conv"
  bottom: "layer2-conv"
  top: "layer9-concat"
  phase: TRAIN
}
layer {
  name: "layer9-concat_fixed"
  type: "FixedNeuron"
  bottom: "layer9-concat"
  top: "layer9-concat"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer10-conv"
  type: "Convolution"
  bottom: "layer9-concat"
  top: "layer10-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer10-act"
  type: "ReLU"
  bottom: "layer10-conv"
  top: "layer10-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer10-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer10-conv"
  top: "layer10-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer11-conv"
  type: "Convolution"
  bottom: "layer10-conv"
  top: "layer11-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "layer11-act"
  type: "ReLU"
  bottom: "layer11-conv"
  top: "layer11-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer11-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer11-conv"
  top: "layer11-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer12-conv"
  type: "Convolution"
  bottom: "layer11-conv"
  top: "layer12-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer12-act"
  type: "ReLU"
  bottom: "layer12-conv"
  top: "layer12-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer14-conv"
  type: "Convolution"
  bottom: "layer11-conv"
  top: "layer14-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer14-act"
  type: "ReLU"
  bottom: "layer14-conv"
  top: "layer14-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer14-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer14-conv"
  top: "layer14-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer15-conv"
  type: "Convolution"
  bottom: "layer14-conv"
  top: "layer15-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer15-act"
  type: "ReLU"
  bottom: "layer15-conv"
  top: "layer15-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer15-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer15-conv"
  top: "layer15-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer16-conv"
  type: "Convolution"
  bottom: "layer15-conv"
  top: "layer16-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer16-act"
  type: "ReLU"
  bottom: "layer16-conv"
  top: "layer16-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer16-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer16-conv"
  top: "layer16-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer17-shortcut"
  type: "Eltwise"
  bottom: "layer14-conv"
  bottom: "layer16-conv"
  top: "layer17-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer17-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer17-shortcut"
  top: "layer17-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer18-conv"
  type: "Convolution"
  bottom: "layer17-shortcut"
  top: "layer18-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer18-act"
  type: "ReLU"
  bottom: "layer18-conv"
  top: "layer18-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer18-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer18-conv"
  top: "layer18-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer19-conv"
  type: "Convolution"
  bottom: "layer18-conv"
  top: "layer19-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer19-act"
  type: "ReLU"
  bottom: "layer19-conv"
  top: "layer19-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer19-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer19-conv"
  top: "layer19-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer20-shortcut"
  type: "Eltwise"
  bottom: "layer17-shortcut"
  bottom: "layer19-conv"
  top: "layer20-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer20-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer20-shortcut"
  top: "layer20-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer21-conv"
  type: "Convolution"
  bottom: "layer20-shortcut"
  top: "layer21-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer21-act"
  type: "ReLU"
  bottom: "layer21-conv"
  top: "layer21-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer22-concat"
  type: "Concat"
  bottom: "layer21-conv"
  bottom: "layer12-conv"
  top: "layer22-concat"
  phase: TRAIN
}
layer {
  name: "layer22-concat_fixed"
  type: "FixedNeuron"
  bottom: "layer22-concat"
  top: "layer22-concat"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer23-conv"
  type: "Convolution"
  bottom: "layer22-concat"
  top: "layer23-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer23-act"
  type: "ReLU"
  bottom: "layer23-conv"
  top: "layer23-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer23-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer23-conv"
  top: "layer23-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer24-conv"
  type: "Convolution"
  bottom: "layer23-conv"
  top: "layer24-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "layer24-act"
  type: "ReLU"
  bottom: "layer24-conv"
  top: "layer24-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer24-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer24-conv"
  top: "layer24-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer25-conv"
  type: "Convolution"
  bottom: "layer24-conv"
  top: "layer25-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer25-act"
  type: "ReLU"
  bottom: "layer25-conv"
  top: "layer25-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer27-conv"
  type: "Convolution"
  bottom: "layer24-conv"
  top: "layer27-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer27-act"
  type: "ReLU"
  bottom: "layer27-conv"
  top: "layer27-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer27-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer27-conv"
  top: "layer27-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer28-conv"
  type: "Convolution"
  bottom: "layer27-conv"
  top: "layer28-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer28-act"
  type: "ReLU"
  bottom: "layer28-conv"
  top: "layer28-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer28-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer28-conv"
  top: "layer28-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer29-conv"
  type: "Convolution"
  bottom: "layer28-conv"
  top: "layer29-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer29-act"
  type: "ReLU"
  bottom: "layer29-conv"
  top: "layer29-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer29-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer29-conv"
  top: "layer29-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer30-shortcut"
  type: "Eltwise"
  bottom: "layer27-conv"
  bottom: "layer29-conv"
  top: "layer30-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer30-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer30-shortcut"
  top: "layer30-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer31-conv"
  type: "Convolution"
  bottom: "layer30-shortcut"
  top: "layer31-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer31-act"
  type: "ReLU"
  bottom: "layer31-conv"
  top: "layer31-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer31-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer31-conv"
  top: "layer31-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer32-conv"
  type: "Convolution"
  bottom: "layer31-conv"
  top: "layer32-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer32-act"
  type: "ReLU"
  bottom: "layer32-conv"
  top: "layer32-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer32-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer32-conv"
  top: "layer32-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer33-shortcut"
  type: "Eltwise"
  bottom: "layer30-shortcut"
  bottom: "layer32-conv"
  top: "layer33-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer33-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer33-shortcut"
  top: "layer33-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer34-conv"
  type: "Convolution"
  bottom: "layer33-shortcut"
  top: "layer34-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer34-act"
  type: "ReLU"
  bottom: "layer34-conv"
  top: "layer34-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer34-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer34-conv"
  top: "layer34-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer35-conv"
  type: "Convolution"
  bottom: "layer34-conv"
  top: "layer35-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer35-act"
  type: "ReLU"
  bottom: "layer35-conv"
  top: "layer35-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer35-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer35-conv"
  top: "layer35-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer36-shortcut"
  type: "Eltwise"
  bottom: "layer33-shortcut"
  bottom: "layer35-conv"
  top: "layer36-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer36-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer36-shortcut"
  top: "layer36-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer37-conv"
  type: "Convolution"
  bottom: "layer36-shortcut"
  top: "layer37-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer37-act"
  type: "ReLU"
  bottom: "layer37-conv"
  top: "layer37-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer37-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer37-conv"
  top: "layer37-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer38-conv"
  type: "Convolution"
  bottom: "layer37-conv"
  top: "layer38-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer38-act"
  type: "ReLU"
  bottom: "layer38-conv"
  top: "layer38-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer38-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer38-conv"
  top: "layer38-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer39-shortcut"
  type: "Eltwise"
  bottom: "layer36-shortcut"
  bottom: "layer38-conv"
  top: "layer39-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer39-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer39-shortcut"
  top: "layer39-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer40-conv"
  type: "Convolution"
  bottom: "layer39-shortcut"
  top: "layer40-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer40-act"
  type: "ReLU"
  bottom: "layer40-conv"
  top: "layer40-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer40-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer40-conv"
  top: "layer40-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer41-conv"
  type: "Convolution"
  bottom: "layer40-conv"
  top: "layer41-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer41-act"
  type: "ReLU"
  bottom: "layer41-conv"
  top: "layer41-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer41-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer41-conv"
  top: "layer41-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer42-shortcut"
  type: "Eltwise"
  bottom: "layer39-shortcut"
  bottom: "layer41-conv"
  top: "layer42-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer42-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer42-shortcut"
  top: "layer42-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer43-conv"
  type: "Convolution"
  bottom: "layer42-shortcut"
  top: "layer43-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer43-act"
  type: "ReLU"
  bottom: "layer43-conv"
  top: "layer43-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer43-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer43-conv"
  top: "layer43-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer44-conv"
  type: "Convolution"
  bottom: "layer43-conv"
  top: "layer44-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer44-act"
  type: "ReLU"
  bottom: "layer44-conv"
  top: "layer44-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer44-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer44-conv"
  top: "layer44-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer45-shortcut"
  type: "Eltwise"
  bottom: "layer42-shortcut"
  bottom: "layer44-conv"
  top: "layer45-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer45-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer45-shortcut"
  top: "layer45-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer46-conv"
  type: "Convolution"
  bottom: "layer45-shortcut"
  top: "layer46-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer46-act"
  type: "ReLU"
  bottom: "layer46-conv"
  top: "layer46-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer46-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer46-conv"
  top: "layer46-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer47-conv"
  type: "Convolution"
  bottom: "layer46-conv"
  top: "layer47-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer47-act"
  type: "ReLU"
  bottom: "layer47-conv"
  top: "layer47-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer47-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer47-conv"
  top: "layer47-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer48-shortcut"
  type: "Eltwise"
  bottom: "layer45-shortcut"
  bottom: "layer47-conv"
  top: "layer48-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer48-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer48-shortcut"
  top: "layer48-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer49-conv"
  type: "Convolution"
  bottom: "layer48-shortcut"
  top: "layer49-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer49-act"
  type: "ReLU"
  bottom: "layer49-conv"
  top: "layer49-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer49-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer49-conv"
  top: "layer49-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer50-conv"
  type: "Convolution"
  bottom: "layer49-conv"
  top: "layer50-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer50-act"
  type: "ReLU"
  bottom: "layer50-conv"
  top: "layer50-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer50-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer50-conv"
  top: "layer50-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer51-shortcut"
  type: "Eltwise"
  bottom: "layer48-shortcut"
  bottom: "layer50-conv"
  top: "layer51-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer51-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer51-shortcut"
  top: "layer51-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer52-conv"
  type: "Convolution"
  bottom: "layer51-shortcut"
  top: "layer52-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer52-act"
  type: "ReLU"
  bottom: "layer52-conv"
  top: "layer52-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer53-concat"
  type: "Concat"
  bottom: "layer52-conv"
  bottom: "layer25-conv"
  top: "layer53-concat"
  phase: TRAIN
}
layer {
  name: "layer53-concat_fixed"
  type: "FixedNeuron"
  bottom: "layer53-concat"
  top: "layer53-concat"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer54-conv"
  type: "Convolution"
  bottom: "layer53-concat"
  top: "layer54-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer54-act"
  type: "ReLU"
  bottom: "layer54-conv"
  top: "layer54-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer54-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer54-conv"
  top: "layer54-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer55-conv"
  type: "Convolution"
  bottom: "layer54-conv"
  top: "layer55-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "layer55-act"
  type: "ReLU"
  bottom: "layer55-conv"
  top: "layer55-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer55-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer55-conv"
  top: "layer55-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer56-conv"
  type: "Convolution"
  bottom: "layer55-conv"
  top: "layer56-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer56-act"
  type: "ReLU"
  bottom: "layer56-conv"
  top: "layer56-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer58-conv"
  type: "Convolution"
  bottom: "layer55-conv"
  top: "layer58-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer58-act"
  type: "ReLU"
  bottom: "layer58-conv"
  top: "layer58-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer58-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer58-conv"
  top: "layer58-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer59-conv"
  type: "Convolution"
  bottom: "layer58-conv"
  top: "layer59-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer59-act"
  type: "ReLU"
  bottom: "layer59-conv"
  top: "layer59-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer59-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer59-conv"
  top: "layer59-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer60-conv"
  type: "Convolution"
  bottom: "layer59-conv"
  top: "layer60-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer60-act"
  type: "ReLU"
  bottom: "layer60-conv"
  top: "layer60-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer60-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer60-conv"
  top: "layer60-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer61-shortcut"
  type: "Eltwise"
  bottom: "layer58-conv"
  bottom: "layer60-conv"
  top: "layer61-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer61-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer61-shortcut"
  top: "layer61-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer62-conv"
  type: "Convolution"
  bottom: "layer61-shortcut"
  top: "layer62-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer62-act"
  type: "ReLU"
  bottom: "layer62-conv"
  top: "layer62-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer62-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer62-conv"
  top: "layer62-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer63-conv"
  type: "Convolution"
  bottom: "layer62-conv"
  top: "layer63-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer63-act"
  type: "ReLU"
  bottom: "layer63-conv"
  top: "layer63-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer63-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer63-conv"
  top: "layer63-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer64-shortcut"
  type: "Eltwise"
  bottom: "layer61-shortcut"
  bottom: "layer63-conv"
  top: "layer64-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer64-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer64-shortcut"
  top: "layer64-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer65-conv"
  type: "Convolution"
  bottom: "layer64-shortcut"
  top: "layer65-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer65-act"
  type: "ReLU"
  bottom: "layer65-conv"
  top: "layer65-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer65-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer65-conv"
  top: "layer65-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer66-conv"
  type: "Convolution"
  bottom: "layer65-conv"
  top: "layer66-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer66-act"
  type: "ReLU"
  bottom: "layer66-conv"
  top: "layer66-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer66-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer66-conv"
  top: "layer66-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer67-shortcut"
  type: "Eltwise"
  bottom: "layer64-shortcut"
  bottom: "layer66-conv"
  top: "layer67-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer67-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer67-shortcut"
  top: "layer67-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer68-conv"
  type: "Convolution"
  bottom: "layer67-shortcut"
  top: "layer68-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer68-act"
  type: "ReLU"
  bottom: "layer68-conv"
  top: "layer68-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer68-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer68-conv"
  top: "layer68-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer69-conv"
  type: "Convolution"
  bottom: "layer68-conv"
  top: "layer69-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer69-act"
  type: "ReLU"
  bottom: "layer69-conv"
  top: "layer69-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer69-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer69-conv"
  top: "layer69-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer70-shortcut"
  type: "Eltwise"
  bottom: "layer67-shortcut"
  bottom: "layer69-conv"
  top: "layer70-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer70-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer70-shortcut"
  top: "layer70-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer71-conv"
  type: "Convolution"
  bottom: "layer70-shortcut"
  top: "layer71-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer71-act"
  type: "ReLU"
  bottom: "layer71-conv"
  top: "layer71-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer71-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer71-conv"
  top: "layer71-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer72-conv"
  type: "Convolution"
  bottom: "layer71-conv"
  top: "layer72-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer72-act"
  type: "ReLU"
  bottom: "layer72-conv"
  top: "layer72-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer72-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer72-conv"
  top: "layer72-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer73-shortcut"
  type: "Eltwise"
  bottom: "layer70-shortcut"
  bottom: "layer72-conv"
  top: "layer73-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer73-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer73-shortcut"
  top: "layer73-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer74-conv"
  type: "Convolution"
  bottom: "layer73-shortcut"
  top: "layer74-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer74-act"
  type: "ReLU"
  bottom: "layer74-conv"
  top: "layer74-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer74-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer74-conv"
  top: "layer74-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer75-conv"
  type: "Convolution"
  bottom: "layer74-conv"
  top: "layer75-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer75-act"
  type: "ReLU"
  bottom: "layer75-conv"
  top: "layer75-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer75-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer75-conv"
  top: "layer75-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer76-shortcut"
  type: "Eltwise"
  bottom: "layer73-shortcut"
  bottom: "layer75-conv"
  top: "layer76-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer76-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer76-shortcut"
  top: "layer76-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer77-conv"
  type: "Convolution"
  bottom: "layer76-shortcut"
  top: "layer77-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer77-act"
  type: "ReLU"
  bottom: "layer77-conv"
  top: "layer77-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer77-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer77-conv"
  top: "layer77-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer78-conv"
  type: "Convolution"
  bottom: "layer77-conv"
  top: "layer78-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer78-act"
  type: "ReLU"
  bottom: "layer78-conv"
  top: "layer78-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer78-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer78-conv"
  top: "layer78-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer79-shortcut"
  type: "Eltwise"
  bottom: "layer76-shortcut"
  bottom: "layer78-conv"
  top: "layer79-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer79-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer79-shortcut"
  top: "layer79-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer80-conv"
  type: "Convolution"
  bottom: "layer79-shortcut"
  top: "layer80-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer80-act"
  type: "ReLU"
  bottom: "layer80-conv"
  top: "layer80-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer80-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer80-conv"
  top: "layer80-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer81-conv"
  type: "Convolution"
  bottom: "layer80-conv"
  top: "layer81-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer81-act"
  type: "ReLU"
  bottom: "layer81-conv"
  top: "layer81-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer81-conv_fixed"
  type: "FixedNeuron"
  bottom: "layer81-conv"
  top: "layer81-conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer82-shortcut"
  type: "Eltwise"
  bottom: "layer79-shortcut"
  bottom: "layer81-conv"
  top: "layer82-shortcut"
  phase: TRAIN
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "layer82-shortcut_fixed"
  type: "FixedNeuron"
  bottom: "layer82-shortcut"
  top: "layer82-shortcut"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer83-conv"
  type: "Convolution"
  bottom: "layer82-shortcut"
  top: "layer83-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer83-act"
  type: "ReLU"
  bottom: "layer83-conv"
  top: "layer83-conv"
  phase: TRAIN
  relu_param {
    negative_slope: 0.1015625
  }
}
layer {
  name: "layer84-concat"
  type: "Concat"
  bottom: "layer83-conv"
  bottom: "layer56-conv"
  top: "layer84-concat"
  phase: TRAIN
}
layer {
  name: "layer84-concat_fixed"
  type: "FixedNeuron"
  bottom: "layer84-concat"
  top: "layer84-concat"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  phase: TRAIN
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "layer85-conv"
  type: "Convolution"
  bottom: "layer84-concat"
  top: "layer85-conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  phase: TRAIN
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "layer85-act"
  type: "ReLU"
